Hello, 

Can confirm, with qemu guest agent enabled it's not the only attribute : 
- `ipv4_addresses`
- `ipv6_addresses`
- `mac_addresses`
- `network_interface_names`

```
Terraform will perform the following actions:

  # proxmox_virtual_environment_vm.vm is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "vm" {
      ~ id                      = "105" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "192.168.10.91",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "2a0c:b641:2c0:110::91",
              - "fe80::be24:11ff:fe17:8eaf",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "BC:24:11:17:8E:AF",
        ] -> (known after apply)
        name                    = "worker1.unicornafk.fr"
      ~ network_interface_names = [
          - "lo",
          - "enp6s18",
        ] -> (known after apply)
        tags                    = [
            "ansible_managed",
            "kubernetes",
            "kubernetes_worker",
        ]
      ~ vm_id                   = 105 -> (known after apply)
        # (20 unchanged attributes hidden)

      ~ disk {
          ~ file_format       = "raw" -> (known after apply)
          ~ path_in_datastore = "vm-105-disk-1" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ network_device {
          ~ mac_address = "BC:24:11:17:8E:AF" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

[here is my terraform configuration if needed](https://github.com/M0NsTeRRR/homelabv3-infra/blob/main/terraform/modules/vm/main.tf)
